public/archive/backup/freebsd.org
#+SETUPFILE: /Users/kbusi/Devel/org-html-themes/setup/theme-readtheorg-local.setup
#+TITLE: freebsd notes 

Sys Admin Notes 
------

* System Administration
** Install FreeBSD Source Code
  #+BEGIN_SRC sh
  svn checkout https://svn.FreeBSD.org/base/releng/10.2 /usr/src
  #+END_SRC
  - where the 10.2 is your current release
  - svn.FreeBSD.org will automatically choose a mirror near you

** Inspect Boot log
  #+BEGIN_SRC sh
  $ cat /var/run/dmesg.boot
  #+END_SRC


** Modify default editor from vi to nano
  #+BEGIN_SRC sh
  # For C based shell
  $ setenv EDITOR </path/to/nano>
  
  # To find path to nano
  $ which nano
  #+END_SRC


** Check disk space usage by directory
  #+BEGIN_SRC sh
  $ sudo du -hd1 /usr
  #+END_SRC


** Expand Partition to Entire Drive
   When a VPS is upgraded to a larger instance, the expanded drive is not 
   recognized by the OS
  
   - [[https://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/disks-growing.html][Tutorial here]]
     #+BEGIN_SRC sh
     $ gpart recover vtbd0
     $ gpart resize -i 2 vtbd0  # 2=what is shown on gpart show vtbd0
     $ growfs -y /
    
     # Verify extra displace exists
     $ df -h
    
    # Update /etc/fstab
    #+END_SRC


    - On reboot, goes to mountroot prompt
      #+BEGIN_SRC sh
      # do a ? to see list of available disks
      $ ufs:/dev/vtbd0s1 
      #+END_SRC



** Edit Crontab
   #+BEGIN_SRC sh
   $ crontab -e
   #+END_SRC



** View traffic on network interfaces

    #+BEGIN_SRC sh
      $ systat -ifstat 1
    #+END_SRC

------


* Deploy Python App to FreeBSD Jail

  - Update pkg

    #+BEGIN_SRC sh
    $ pkg update
    #+END_SRC

  - Install Dependencies using pkg

    #+BEGIN_SRC sh
    $ pkg install python
    $ pkg install py27-pip 
    $ pkg install sqlite3
    $ pkg install py27-sqlite3
    $ pkg install git
    $ pkg install nano
    $ pkg install postgresql94-client # so psycopg2 installs using pip
                                      # Need to specify version ex: 94 
    $ pkg install nginx
    $ pkg install py27-supervisor
    #+END_SRC

  - Install Virtualenv

    #+BEGIN_SRC sh
    # install virtualenv
    $ pip install virtualenv
    
    #END_SRC

  - Add SSH public key to Bitbucket or Github

    So you can clone the project


  - Clone the project to your server

    Ex: Create a /var/www/ directory and clone into there


  - Create a virtual env

    I keep my virtualenv inside my project as venv to keep it selfcontained

    #+BEGIN_SRC sh 
    $ virtualenv --no-site-packages venv
    # Activate virtual env (not the csh special script)
    $ source venv/bin/activate.csh
       #+END_SRC


  - Install requirements into virtualenv using pip 
    
    Be sure virtual env is active 

    #+BEGIN_SRC sh
    $ pip install -r requirements.txt
    #+END_SRC

    - You might get errors if you use uwsgi using pkg b/c virtualenv path
      wont be recognized. Use pip install uwsgi and run
      venv/bin/uwsgi --socket 127.0.0.1:8080 --protocol=http -w receiptapp.py
    - link:https://www.digitalocean.com/community/tutorials/how-to-deploy-python-wsgi-applications-using-uwsgi-web-server-with-nginx


  - Verify nginx is also running in jail
    #+BEGIN_SRC sh
    $ service nginx status
    Cannot 'status' nginx. Set nginx_enable to YES in /etc/rc.conf or use 'onestatus' instead of 'status'.
    #+END_SRC

    - On a fresh install of nginx, if you get a message like that
      - Add nginx_enable="YES" to /etc/defaults/rc.conf
        #+BEGIN_SRC sh
        nginx_enable="YES"        
        #+END_SRC

    - Verify nginx status again

      #+BEGIN_SRC sh
      service nginx status
      nginx is not running.      
      #+END_SRC

    - Start nginx

   - by pointing to default nginx page in jail to verify forwarding works

** Create Postgres user and database
#+BEGIN_SRC sh
# swith to pgsql user
$ su pgsql

# Connect to database
$ psql template1

OR
# Connect as root specifying user and database
$ psql -d template1 -u pgsql


# Create user w/ perm to create databases. (man createuser to see options)
$ createuser -sdrP username 

# Createdb 
$ createdb <dbname>

# Connect as user create
$ psql -U <username> -h <hostname> -d <database_name>

#+END_SRC

** Run bootstrap.py 
** Verify can connect to db and see tables created
** Make sure app is connecting to correct database by running it locally
   - activate virtual env
   - Run python app.py 
   - should run wihout errors

** Point webserver to nginx in app jail

** Make sure supervisor is installed (py27-supervisor)
** Start supervisord service
#+BEGIN_SRC sh
service supervisord start
#+END_SRC

