public/archive/freebsd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-07-25 Tue 13:44 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>freebsd notes</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="kiran" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">freebsd notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline8">System Administration</a>
<ul>
<li><a href="#orgheadline1">Install FreeBSD Source Code</a></li>
<li><a href="#orgheadline2">Inspect Boot log</a></li>
<li><a href="#orgheadline3">Modify default editor from vi to nano</a></li>
<li><a href="#orgheadline4">Check disk space usage by directory</a></li>
<li><a href="#orgheadline5">Expand Partition to Entire Drive</a></li>
<li><a href="#orgheadline6">Edit Crontab</a></li>
<li><a href="#orgheadline7">View traffic on network interfaces</a></li>
</ul>
</li>
<li><a href="#orgheadline9">Deploy Python App to FreeBSD Jail</a>
<ul>
<li><a href="#orgheadline10">Create Postgres user and database</a></li>
<li><a href="#orgheadline11">Run bootstrap.py</a></li>
<li><a href="#orgheadline12">Verify can connect to db and see tables created</a></li>
<li><a href="#orgheadline13">Make sure app is connecting to correct database by running it locally</a></li>
<li><a href="#orgheadline14">Point webserver to nginx in app jail</a></li>
<li><a href="#orgheadline15">Make sure supervisor is installed (py27-supervisor)</a></li>
<li><a href="#orgheadline16">Start supervisord service</a></li>
<li><a href="#orgheadline17">Edit supervisor.conf file in /usr/local/etc/supervisor.conf</a></li>
<li><a href="#orgheadline18">Set nginx and supervisor to start on system start</a></li>
<li><a href="#orgheadline19">Edit nginx.conf file to have this include statement in http block</a></li>
<li><a href="#orgheadline20">Create conf.d directory if it doesn't exist</a></li>
<li><a href="#orgheadline21">copy nginx.conf file to <i>usr/local/etc/nginx/conf.d</i></a></li>
<li><a href="#orgheadline22">Restart nginx, make sure no errors</a></li>
<li><a href="#orgheadline23">Verify URL works in browser</a></li>
<li><a href="#orgheadline26">Troubleshooting</a>
<ul>
<li><a href="#orgheadline24">Check log files</a></li>
<li><a href="#orgheadline25">IOError: decoder jpeg not available</a></li>
</ul>
</li>
<li><a href="#orgheadline27">Reference:</a></li>
</ul>
</li>
<li><a href="#orgheadline32">FreeBSD Jails</a>
<ul>
<li><a href="#orgheadline28">Manage Jails using ezjail-admin</a></li>
<li><a href="#orgheadline29">Create new Jail</a>
<ul>
<li><a href="#orgheadline30">Create an ip address for jail</a></li>
</ul>
</li>
<li><a href="#orgheadline31">Enable networking in jail</a></li>
</ul>
</li>
<li><a href="#orgheadline33">Using fetch fails with ssl auth error</a>
<ul>
<li><a href="#orgheadline34">Reason: Certificate verification failed</a></li>
</ul>
</li>
<li><a href="#orgheadline35">Starting PostGres in jail</a></li>
<li><a href="#orgheadline36">Running Ghost</a></li>
<li><a href="#orgheadline37">Jenkins</a></li>
<li><a href="#orgheadline38">References</a></li>
</ul>
</div>
</div>
<p>
Sys Admin Notes 
</p>
<hr  />

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8">System Administration</h2>
<div class="outline-text-2" id="text-orgheadline8">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1">Install FreeBSD Source Code</h3>
<div class="outline-text-3" id="text-orgheadline1">
<div class="org-src-container">

<pre class="src src-sh">svn checkout https://svn.FreeBSD.org/base/releng/10.2 /usr/src
</pre>
</div>
<ul class="org-ul">
<li>where the 10.2 is your current release</li>
<li>svn.FreeBSD.org will automatically choose a mirror near you</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">Inspect Boot log</h3>
<div class="outline-text-3" id="text-orgheadline2">
<div class="org-src-container">

<pre class="src src-sh">$ cat /var/run/dmesg.boot
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">Modify default editor from vi to nano</h3>
<div class="outline-text-3" id="text-orgheadline3">
<div class="org-src-container">

<pre class="src src-sh"># For C based shell
$ setenv EDITOR &lt;/path/to/nano&gt;

# To find path to nano
$ which nano
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">Check disk space usage by directory</h3>
<div class="outline-text-3" id="text-orgheadline4">
<div class="org-src-container">

<pre class="src src-sh">$ sudo du -hd1 /usr
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">Expand Partition to Entire Drive</h3>
<div class="outline-text-3" id="text-orgheadline5">
<p>
When a VPS is upgraded to a larger instance, the expanded drive is not 
recognized by the OS
</p>

<ul class="org-ul">
<li><p>
<a href="https://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/disks-growing.html">Tutorial here</a>
</p>
<div class="org-src-container">

<pre class="src src-sh"> $ gpart recover vtbd0
 $ gpart resize -i 2 vtbd0  # 2=what is shown on gpart show vtbd0
 $ growfs -y /

 # Verify extra displace exists
 $ df -h

# Update /etc/fstab
</pre>
</div></li>
</ul>


<ul class="org-ul">
<li><p>
On reboot, goes to mountroot prompt
</p>
<div class="org-src-container">

<pre class="src src-sh"># do a ? to see list of available disks
$ ufs:/dev/vtbd0s1
</pre>
</div></li>
</ul>
</div>
</div>



<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6">Edit Crontab</h3>
<div class="outline-text-3" id="text-orgheadline6">
<div class="org-src-container">

<pre class="src src-sh">$ crontab -e
</pre>
</div>
</div>
</div>



<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7">View traffic on network interfaces</h3>
<div class="outline-text-3" id="text-orgheadline7">
<div class="org-src-container">

<pre class="src src-sh">$ systat -ifstat 1
</pre>
</div>

<hr  />
</div>
</div>
</div>


<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9">Deploy Python App to FreeBSD Jail</h2>
<div class="outline-text-2" id="text-orgheadline9">
<ul class="org-ul">
<li><p>
Update pkg
</p>

<div class="org-src-container">

<pre class="src src-sh">$ pkg update
</pre>
</div></li>

<li><p>
Install Dependencies using pkg
</p>

<div class="org-src-container">

<pre class="src src-sh">$ pkg install python
$ pkg install py27-pip 
$ pkg install sqlite3
$ pkg install py27-sqlite3
$ pkg install git
$ pkg install nano
$ pkg install postgresql94-client # so psycopg2 installs using pip
                                  # Need to specify version ex: 94 
$ pkg install nginx
$ pkg install py27-supervisor
</pre>
</div></li>

<li><p>
Install Virtualenv
</p>

<div class="org-src-container">

<pre class="src src-sh">  # install virtualenv
  $ pip install virtualenv

  #END_SRC

- Add SSH public key to Bitbucket or Github

  So you can clone the project


- Clone the project to your server

  Ex: Create a /var/www/ directory and clone into there


- Create a virtual env

  I keep my virtualenv inside my project as venv to keep it selfcontained

  #+BEGIN_SRC sh 
  $ virtualenv --no-site-packages venv
  # Activate virtual env (not the csh special script)
  $ source venv/bin/activate.csh
</pre>
</div></li>
</ul>


<ul class="org-ul">
<li><p>
Install requirements into virtualenv using pip 
</p>

<p>
Be sure virtual env is active 
</p>

<div class="org-src-container">

<pre class="src src-sh">$ pip install -r requirements.txt
</pre>
</div>

<ul class="org-ul">
<li>You might get errors if you use uwsgi using pkg b/c virtualenv path
wont be recognized. Use pip install uwsgi and run
venv/bin/uwsgi &#x2013;socket 127.0.0.1:8080 &#x2013;protocol=http -w receiptapp.py</li>
<li>link:<a href="https://www.digitalocean.com/community/tutorials/how-to-deploy-python-wsgi-applications-using-uwsgi-web-server-with-nginx">https://www.digitalocean.com/community/tutorials/how-to-deploy-python-wsgi-applications-using-uwsgi-web-server-with-nginx</a></li>
</ul></li>
</ul>


<ul class="org-ul">
<li><p>
Verify nginx is also running in jail
</p>
<div class="org-src-container">

<pre class="src src-sh">$ service nginx status
Cannot 'status' nginx. Set nginx_enable to YES in /etc/rc.conf or use 'onestatus' instead of 'status'.
</pre>
</div>

<ul class="org-ul">
<li>On a fresh install of nginx, if you get a message like that
<ul class="org-ul">
<li><p>
Add nginx<sub>enable</sub>="YES" to /etc/defaults/rc.conf
</p>
<div class="org-src-container">

<pre class="src src-sh">nginx_enable="YES"
</pre>
</div></li>
</ul></li>

<li><p>
Verify nginx status again
</p>

<div class="org-src-container">

<pre class="src src-sh">service nginx status
nginx is not running.
</pre>
</div></li>

<li>Start nginx</li>
</ul>
<ul class="org-ul">
<li>by pointing to default nginx page in jail to verify forwarding works</li>
</ul></li>
</ul>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10">Create Postgres user and database</h3>
<div class="outline-text-3" id="text-orgheadline10">
<div class="org-src-container">

<pre class="src src-sh"># swith to pgsql user
$ su pgsql

# Connect to database
$ psql template1

OR
# Connect as root specifying user and database
$ psql -d template1 -u pgsql


# Create user w/ perm to create databases. (man createuser to see options)
$ createuser -sdrP username 

# Createdb 
$ createdb &lt;dbname&gt;

# Connect as user create
$ psql -U &lt;username&gt; -h &lt;hostname&gt; -d &lt;database_name&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11">Run bootstrap.py</h3>
</div>
<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12">Verify can connect to db and see tables created</h3>
</div>
<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13">Make sure app is connecting to correct database by running it locally</h3>
<div class="outline-text-3" id="text-orgheadline13">
<ul class="org-ul">
<li>activate virtual env</li>
<li>Run python app.py</li>
<li>should run wihout errors</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14">Point webserver to nginx in app jail</h3>
</div>

<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15">Make sure supervisor is installed (py27-supervisor)</h3>
</div>
<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16">Start supervisord service</h3>
<div class="outline-text-3" id="text-orgheadline16">
<div class="org-src-container">

<pre class="src src-sh">service supervisord start
</pre>
</div>
</div>
</div>
