public/archive/backup/freebsd.org
** Edit supervisor.conf file in /usr/local/etc/supervisor.conf
#+BEGIN_SRC sh
[program:uwsgi_myapp]
directory=/usr/local/www/myapp/
command=/usr/local/bin/uwsgi -s /var/run/%(program_name)s%(process_num)d.sock
        --chmod-socket=666 --need-app --disable-logging --home=venv
        --wsgi-file wsgi.py --processes 1 --threads 10
stdout_logfile="syslog"
stderr_logfile="syslog"
startsecs=10
stopsignal=QUIT
stopasgroup=true
killasgroup=true
process_name=%(program_name)s%(process_num)d
numprocs=5
#+END_SRC

** Set nginx and supervisor to start on system start
   - edit /etc/defaults/rc.conf to have (note the defaults b/c its in jail)
#+BEGIN_SRC sh
supervisord_enable="YES"
nginx_enable="YES"
#+END_SRC

** Edit nginx.conf file to have this include statement in http block
#+BEGIN_SRC sh
include /usr/local/etc/nginx/conf.d/*.conf;
#+END_SRC

** Create conf.d directory if it doesn't exist
** copy nginx.conf file to /usr/local/etc/nginx/conf.d/
** Restart nginx, make sure no errors
** Verify URL works in browser

** Troubleshooting
*** Check log files
   - app uwsgi log file specified in ini file first for clues
   - check nginx error log file 

*** IOError: decoder jpeg not available
    
    Use pillow instead of PIL
    Make sure dependencies for PIL/pillow are installed
    Remove pillow and reinstall after dependencies installed on OS

    - On Ubuntu, make sure libjpeg8-dev library is installed
      Uninstall and re-install pillow

    - On FreeBSD
      #+BEGIN_SRC sh
      $ pkg search jpeg-8
      jpeg-8-6
      $ pkg install jpeg-8_6
      #+END_SRC

      - Uninstall and reinstall pillow
      - Test you can create a thumbnail using Python REPL
        #+BEGIN_SRC sh
        # python
        Python 2.7.10 (default, Aug  9 2015, 01:20:33)
        [GCC 4.2.1 Compatible FreeBSD Clang 3.4.1 (tags/RELEASE_34/dot1-final 208032)] on freebsd10
        Type "help", "copyright", "credits" or "license" for more information.
        >>> from PIL import Image
        >>> im = Image.open('jpeg-file-full-path')
        >>> im.thumbnail((128,128), Image.ANTIALIAS)        
        #+END_SRC


** Reference: 
- https://www.srijn.net/notes/django-uwsgi-nginx-on-freebsd.html

- [[https://translate.google.com/translate?u=http://mainview.ru/raznoe/unix/python-image-library-pil-vo-freebsd&langpair=ru|en&ie=UTF8][jpeg decoder on freebsd]]
------




* FreeBSD Jails

** Manage Jails using ezjail-admin
---------------------------------
      #+BEGIN_SRC sh
        # View list of available jails
        $ jls

        # or 
        $ jls -v
        # Log into existing jail
        $ sudo ezjail-admin console <jailname>

        # OR use jexec with number parameter where # parameter == JID 
        # from jls output 
        $ sudo jexec 2 csh

        # OR use execute a command in jail 
        $ sudo jexec 1 hostname
        # show host name of jail with id=1

      #+END_SRC


** Create new Jail

   A condensed version of [[http://www.bsdnow.tv/tutorials/jails][bsdnow]]

*** Create an ip address for jail
   - Find an ipaddress to set for jail
     
     Select the next ip address number
   #+BEGIN_SRC sh
     $ jls
   #+END_SRC


   - Make an alias on your network card with your network settings
   #+BEGIN_SRC sh
     $ sudo ifconfig lo10 alias 10.10.10.15 netmask 0xffffff00
   #+END_SRC

   - Add network alias to /etc/rc.conf so it remembers on reboot
   - Your /etc/rc.conf file will look something like this
   #+BEGIN_SRC sh
   # Setup Jails
   ezjail_enable="YES"
   jail_sysvipc_allow="YES"    # For PostgresSQL

   gateway_enable="YES"

   cloned_interfaces="lo10"
   ifconfig_lo10_alias0="inet 10.10.10.1 netmask 255.255.255.0"
   ifconfig_lo10_alias1="inet 10.10.10.10 netmask 255.255.255.0"
   ifconfig_lo10_alias2="inet 10.10.10.11 netmask 255.255.255.0"
   ifconfig_lo10_alias3="inet 10.10.10.12 netmask 255.255.255.0"
   ifconfig_lo10_alias4="inet 10.10.10.13 netmask 255.255.255.0"
   ifconfig_lo10_alias5="inet 10.10.10.14 netmask 255.255.255.0"
   ifconfig_lo10_alias6="inet 10.10.10.15 netmask 255.255.255.0"
   #+END_SRC

   - Create the actual jail
     - use the ip address created above
     #+BEGIN_SRC sh          
     sudo ezjail-admin create busilogic-blog 10.10.10.15    
     #+END_SRC

   - To enable networking inside jail, copy the resolv.conf file
     #+BEGIN_SRC sh
     sudo cp /etc/resolv.conf /usr/jails/busilogic-blog/etc/     
     #+END_SRC

     - Start the jail
     #+BEGIN_SRC sh
     sudo service ezjail start busilogic-blog     
     #+END_SRC


** Enable networking in jail
---------------------------------
      #+BEGIN_SRC sh
        # Replace jail name with your jail created
        $ cp /etc/resolv.conf /usr/jails/<jailname>/etc/
      #+END_SRC


* Using fetch fails with ssl auth error
---------------------------------------
** Reason: Certificate verification failed

    #+BEGIN_SRC sh
      # Install ca root
      $ pkg install ca_root_nss

      # Then ln or cp the combined root certificates to /etc/ssl/cert.pem
      $ ln -s /usr/local/share/certs/ca-root-nss.crt /etc/ssl/cert.pem
    #+END_SRC


* Starting PostGres in jail
---------------------------
    #+BEGIN_SRC sh
      $ su pgsql
      $ pg_ctl -D /usr/local/pgsql/data initdb /usr/local/bin/pg_ctl -D /usr/local/pgsql/data -l /usr/local/pgsql/postgresql.log start
    #+END_SRC


* Running Ghost
#+BEGIN_SRC sh
# set node env
$ setenv NODE_ENV production

# verify node env set
$ env  # Should see all environment variables

# Run ghost
$ npm start

# Run Ghost forever
$ forever start index.js
#+END_SRC




* Jenkins
- https://wiki.jenkins-ci.org/display/JENKINS/FreeBSD

  Setting up Jenkins on freebsd

