public/archive/freebsd.html

<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17">Edit supervisor.conf file in /usr/local/etc/supervisor.conf</h3>
<div class="outline-text-3" id="text-orgheadline17">
<div class="org-src-container">

<pre class="src src-sh">[program:uwsgi_myapp]
directory=/usr/local/www/myapp/
command=/usr/local/bin/uwsgi -s /var/run/%(program_name)s%(process_num)d.sock
        --chmod-socket=666 --need-app --disable-logging --home=venv
        --wsgi-file wsgi.py --processes 1 --threads 10
stdout_logfile="syslog"
stderr_logfile="syslog"
startsecs=10
stopsignal=QUIT
stopasgroup=true
killasgroup=true
process_name=%(program_name)s%(process_num)d
numprocs=5
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18">Set nginx and supervisor to start on system start</h3>
<div class="outline-text-3" id="text-orgheadline18">
<ul class="org-ul">
<li>edit /etc/defaults/rc.conf to have (note the defaults b/c its in jail)</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">supervisord_enable="YES"
nginx_enable="YES"
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19">Edit nginx.conf file to have this include statement in http block</h3>
<div class="outline-text-3" id="text-orgheadline19">
<div class="org-src-container">

<pre class="src src-sh">include /usr/local/etc/nginx/conf.d/*.conf;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20">Create conf.d directory if it doesn't exist</h3>
</div>
<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21">copy nginx.conf file to <i>usr/local/etc/nginx/conf.d</i></h3>
</div>
<div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22">Restart nginx, make sure no errors</h3>
</div>
<div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23">Verify URL works in browser</h3>
</div>

<div id="outline-container-orgheadline26" class="outline-3">
<h3 id="orgheadline26">Troubleshooting</h3>
<div class="outline-text-3" id="text-orgheadline26">
</div><div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24">Check log files</h4>
<div class="outline-text-4" id="text-orgheadline24">
<ul class="org-ul">
<li>app uwsgi log file specified in ini file first for clues</li>
<li>check nginx error log file</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline25" class="outline-4">
<h4 id="orgheadline25">IOError: decoder jpeg not available</h4>
<div class="outline-text-4" id="text-orgheadline25">
<p>
Use pillow instead of PIL
Make sure dependencies for PIL/pillow are installed
Remove pillow and reinstall after dependencies installed on OS
</p>

<ul class="org-ul">
<li>On Ubuntu, make sure libjpeg8-dev library is installed
Uninstall and re-install pillow</li>

<li><p>
On FreeBSD
</p>
<div class="org-src-container">

<pre class="src src-sh">$ pkg search jpeg-8
jpeg-8-6
$ pkg install jpeg-8_6
</pre>
</div>

<ul class="org-ul">
<li>Uninstall and reinstall pillow</li>
<li><p>
Test you can create a thumbnail using Python REPL
</p>
<div class="org-src-container">

<pre class="src src-sh"># python
Python 2.7.10 (default, Aug  9 2015, 01:20:33)
[GCC 4.2.1 Compatible FreeBSD Clang 3.4.1 (tags/RELEASE_34/dot1-final 208032)] on freebsd10
Type "help", "copyright", "credits" or "license" for more information.
&gt;&gt;&gt; from PIL import Image
&gt;&gt;&gt; im = Image.open('jpeg-file-full-path')
&gt;&gt;&gt; im.thumbnail((128,128), Image.ANTIALIAS)
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgheadline27" class="outline-3">
<h3 id="orgheadline27">Reference:</h3>
<div class="outline-text-3" id="text-orgheadline27">
<ul class="org-ul">
<li><a href="https://www.srijn.net/notes/django-uwsgi-nginx-on-freebsd.html">https://www.srijn.net/notes/django-uwsgi-nginx-on-freebsd.html</a></li>

<li><a href="https://translate.google.com/translate?u=http://mainview.ru/raznoe/unix/python-image-library-pil-vo-freebsd&amp;langpair=ru%7Cen&amp;ie=UTF8">jpeg decoder on freebsd</a></li>
</ul>
<hr  />
</div>
</div>
</div>




<div id="outline-container-orgheadline32" class="outline-2">
<h2 id="orgheadline32">FreeBSD Jails</h2>
<div class="outline-text-2" id="text-orgheadline32">
</div><div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28">Manage Jails using ezjail-admin</h3>
<div class="outline-text-3" id="text-orgheadline28">
<hr  />
<div class="org-src-container">

<pre class="src src-sh"># View list of available jails
$ jls

# or 
$ jls -v
# Log into existing jail
$ sudo ezjail-admin console &lt;jailname&gt;

# OR use jexec with number parameter where # parameter == JID 
# from jls output 
$ sudo jexec 2 csh

# OR use execute a command in jail 
$ sudo jexec 1 hostname
# show host name of jail with id=1
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline29" class="outline-3">
<h3 id="orgheadline29">Create new Jail</h3>
<div class="outline-text-3" id="text-orgheadline29">
<p>
A condensed version of <a href="http://www.bsdnow.tv/tutorials/jails">bsdnow</a>
</p>
</div>

<div id="outline-container-orgheadline30" class="outline-4">
<h4 id="orgheadline30">Create an ip address for jail</h4>
<div class="outline-text-4" id="text-orgheadline30">
<ul class="org-ul">
<li><p>
Find an ipaddress to set for jail
</p>

<p>
Select the next ip address number
</p></li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">$ jls
</pre>
</div>


<ul class="org-ul">
<li>Make an alias on your network card with your network settings</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">$ sudo ifconfig lo10 alias 10.10.10.15 netmask 0xffffff00
</pre>
</div>

<ul class="org-ul">
<li>Add network alias to /etc/rc.conf so it remembers on reboot</li>
<li>Your /etc/rc.conf file will look something like this</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh"># Setup Jails
ezjail_enable="YES"
jail_sysvipc_allow="YES"    # For PostgresSQL

gateway_enable="YES"

cloned_interfaces="lo10"
ifconfig_lo10_alias0="inet 10.10.10.1 netmask 255.255.255.0"
ifconfig_lo10_alias1="inet 10.10.10.10 netmask 255.255.255.0"
ifconfig_lo10_alias2="inet 10.10.10.11 netmask 255.255.255.0"
ifconfig_lo10_alias3="inet 10.10.10.12 netmask 255.255.255.0"
ifconfig_lo10_alias4="inet 10.10.10.13 netmask 255.255.255.0"
ifconfig_lo10_alias5="inet 10.10.10.14 netmask 255.255.255.0"
ifconfig_lo10_alias6="inet 10.10.10.15 netmask 255.255.255.0"
</pre>
</div>

<ul class="org-ul">
<li><p>
Create the actual jail
</p>
<ul class="org-ul">
<li>use the ip address created above</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">sudo ezjail-admin create busilogic-blog 10.10.10.15
</pre>
</div></li>

<li><p>
To enable networking inside jail, copy the resolv.conf file
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo cp /etc/resolv.conf /usr/jails/busilogic-blog/etc/
</pre>
</div>

<ul class="org-ul">
<li>Start the jail</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">sudo service ezjail start busilogic-blog
</pre>
</div></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31">Enable networking in jail</h3>
<div class="outline-text-3" id="text-orgheadline31">
<hr  />
<div class="org-src-container">

<pre class="src src-sh"># Replace jail name with your jail created
$ cp /etc/resolv.conf /usr/jails/&lt;jailname&gt;/etc/
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgheadline33" class="outline-2">
<h2 id="orgheadline33">Using fetch fails with ssl auth error</h2>
<div class="outline-text-2" id="text-orgheadline33">
<hr  />
</div>
<div id="outline-container-orgheadline34" class="outline-3">
<h3 id="orgheadline34">Reason: Certificate verification failed</h3>
<div class="outline-text-3" id="text-orgheadline34">
<div class="org-src-container">

<pre class="src src-sh"># Install ca root
$ pkg install ca_root_nss

# Then ln or cp the combined root certificates to /etc/ssl/cert.pem
$ ln -s /usr/local/share/certs/ca-root-nss.crt /etc/ssl/cert.pem
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgheadline35" class="outline-2">
<h2 id="orgheadline35">Starting PostGres in jail</h2>
<div class="outline-text-2" id="text-orgheadline35">
<hr  />
<div class="org-src-container">

<pre class="src src-sh">$ su pgsql
$ pg_ctl -D /usr/local/pgsql/data initdb /usr/local/bin/pg_ctl -D /usr/local/pgsql/data -l /usr/local/pgsql/postgresql.log start
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline36" class="outline-2">
<h2 id="orgheadline36">Running Ghost</h2>
<div class="outline-text-2" id="text-orgheadline36">
<div class="org-src-container">

<pre class="src src-sh"># set node env
$ setenv NODE_ENV production

# verify node env set
$ env  # Should see all environment variables

# Run ghost
$ npm start

# Run Ghost forever
$ forever start index.js
</pre>
</div>
</div>
</div>




<div id="outline-container-orgheadline37" class="outline-2">
<h2 id="orgheadline37">Jenkins</h2>
<div class="outline-text-2" id="text-orgheadline37">
<ul class="org-ul">
<li><p>
<a href="https://wiki.jenkins-ci.org/display/JENKINS/FreeBSD">https://wiki.jenkins-ci.org/display/JENKINS/FreeBSD</a>
</p>

<p>
Setting up Jenkins on freebsd
</p></li>
</ul>
</div>
</div>
