public/archive/backup/freebsd.org
* References
------------
- http://www.bsdnow.tv/tutorials/jails
- [[https://www.packtpub.com/books/content/securing-network-services-freebsd-jails][Setup new jail with SSH enabled]]
- https://discuss.vultr.com/discussion/432/adding-more-storage/p1
- https://forums.freebsd.org/threads/mountroot.46296/



# - Now update /etc/fstab to use the disk instead of /dev/label/rootfs0
#  ex: /dev/vtbd0s1
#  /dev/vtbd0s1            /               ufs     rw,noatime      1       1
  

# kbusi@lordnibbler:~ % cat /etc/fstab
# Device                Mountpoint              FStype          Options Dump
# Pass
# /dev/label/rootfs0      /               ufs     rw,noatime      1       1
# /dev/label/swap0        none            swap    sw      0       0

# kbusi@lordnibbler:~ % sudo gpart show vtbd0s1
# =>       0  41942880  vtbd0s1  BSD  (20G)
#         0  27355136        1  freebsd-ufs  (13G)
#  27355136   4096000        2  freebsd-swap  (2.0G)
#  31451136  10491744           - free -  (5.0G)

# kbusi@lordnibbler:~ % swapoff /dev/label/swap0
# swapoff: /dev/label/swap0: Operation not permitted
# kbusi@lordnibbler:~ % sudo swapoff /dev/label/swap0
# kbusi@lordnibbler:~ % sudo gpart show vtbd0s1
# =>       0  41942880  vtbd0s1  BSD  (20G)
#          0  27355136        1  freebsd-ufs  (13G)
#  27355136   4096000        2  freebsd-swap  (2.0G)
#  31451136  10491744           - free -  (5.0G)

# kbusi@lordnibbler:~ % sudo gpart delete -i 2 vtbd0s1
# vtbd0s1b deleted
# kbusi@lordnibbler:~ % sudo gpart show vtbd0s1
# =>       0  41942880  vtbd0s1  BSD  (20G)
#          0  27355136        1  freebsd-ufs  (13G)
#  27355136  14587744           - free -  (7.0G)

# kbusi@lordnibbler:~ % sudo gpart resize -i 1 0a 4k -s 18G vtbd0s1
# gpart: Invalid number of arguments.
# kbusi@lordnibbler:~ % sudo gpart resize -i 1 -a 4k -s 18G vtbd0s1
# vtbd0s1a resized
# kbusi@lordnibbler:~ % sudo gpart show vtbd0s1
# =>       0  41942880  vtbd0s1  BSD  (20G)
#          0  37748730        1  freebsd-ufs  (18G)
#  37748730   4194150           - free -  (2.0G)

# kbusi@lordnibbler:~ % sudo gpart add -t freebsd-swap -a 4k vtbd0s1
# vtbd0s1b added
# kbusi@lordnibbler:~ % sudo gpart show vtbd0s1
# =>       0  41942880  vtbd0s1  BSD  (20G)
#          0  37748730        1  freebsd-ufs  (18G)
#  37748730   4194144        2  freebsd-swap  (2.0G)
#  41942874         6           - free -  (3.0K)

# kbusi@lordnibbler:~ % sudo swapon /dev/label/swap0
# swapon: /dev/label/swap0: No such file or directory
# kbusi@lordnibbler:~ % sudo swapon /dev/swap0
# swapon: /dev/swap0: No such file or directory
# kbusi@lordnibbler:~ % cat /etc/fstab
# Device                Mountpoint              FStype          Options Dump
# Pass
# /dev/label/rootfs0 

- [[https://forums.freebsd.org/threads/building-a-10-2-system-from-source.53069/]]
