public/archive/freebsd.html

<div id="outline-container-orgheadline38" class="outline-2">
<h2 id="orgheadline38">References</h2>
<div class="outline-text-2" id="text-orgheadline38">
<hr  />
<ul class="org-ul">
<li><a href="http://www.bsdnow.tv/tutorials/jails">http://www.bsdnow.tv/tutorials/jails</a></li>
<li><a href="https://www.packtpub.com/books/content/securing-network-services-freebsd-jails">Setup new jail with SSH enabled</a></li>
<li><a href="https://discuss.vultr.com/discussion/432/adding-more-storage/p1">https://discuss.vultr.com/discussion/432/adding-more-storage/p1</a></li>
<li><a href="https://forums.freebsd.org/threads/mountroot.46296/">https://forums.freebsd.org/threads/mountroot.46296/</a></li>
</ul>



<ul class="org-ul">
<li><a href="https://forums.freebsd.org/threads/building-a-10-2-system-from-source.53069/">https://forums.freebsd.org/threads/building-a-10-2-system-from-source.53069/</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
